helpers/Utility.php

SELECT * FROM `tablename` WHERE `ID`='2171'
---
    public static function table_details($id,$type)
	{
		$tableDet = Tablename::findOne($id);

SELECT * FROM `users` WHERE `ID`=''
---
	public static function user_details($id,$type)
	{
		$userDet = Users::findOne($id);

SELECT * FROM `product` WHERE `ID`='981'
---
	public static function product_details($id,$type)
	{
		$prodDet = \app\models\Product::findOne($id);