components/ServiceboyComponent.php

	public function orderswithstatus($val)
	{
	    	    	    		 Yii::debug('===orderswithstatus==='.json_encode($val));


		$sqlserviceboydetails = 'select * from serviceboy where ID = \''.$val['header_user_id'].'\'';
		$serviceboydetails = Yii::$app->db->createCommand($sqlserviceboydetails)->queryOne();
		$date = date('Y-m-d');
					$notpaidorderlistarray = $paidorderlistarray = $orderlistarray = array();
					$sqlnotpaidorderlistarray = 'select * from orders where merchant_id = \''.$serviceboydetails['merchant_id'].'\'  ';
					if(!empty($val['orderprocess'])){
		                $orderproces_string =  str_replace(",","','",$val['orderprocess']);
					    $sqlnotpaidorderlistarray .= ' and orderprocess   IN (\''.$orderproces_string.'\') ';
	                }
					$sqlnotpaidorderlistarray .= ' and serviceboy_id = \''.$serviceboydetails['ID'].'\'  ';
					if(!empty($val['sdate'])){
				    	$sqlnotpaidorderlistarray .= '    and reg_date >= \''.$val['sdate'].'\' and reg_date <= \''.$val['edate'].'\'  ';
					}
					$sqlnotpaidorderlistarray .= ' order by ID desc';
					$notpaidorderlistarray = Yii::$app->db->createCommand($sqlnotpaidorderlistarray)->queryAll();

					/*$sqlpaidorderlistarray = 'select * from orders where merchant_id = \''.$serviceboydetails['merchant_id'].'\' and date(reg_date) = \''.$date.'\' and orderprocess IN (\'1\',\'2\',\'4\') and paidstatus = \'1\'
					and serviceboy_id = \''.$serviceboydetails['ID'].'\' order by ID desc';
					$paidorderlistarray = Yii::$app->db->createCommand($sqlpaidorderlistarray)->queryAll();
					*/
					$orderlistarray  = $notpaidorderlistarray ;//array_merge($notpaidorderlistarray,$paidorderlistarray);
					if(!empty($orderlistarray)){
					$orderarray = $totalordersarray = array();
					foreach($orderlistarray as $orderlist){
						$totalproductaarray = array();
						$feedbackDet = \app\models\Feedback::find()->where(['order_id'=>$orderlist['order_id']])->asArray()->one();
---
SELECT * FROM `feedback` WHERE `order_id`='SP340001945'

						if(count($orderproducts) > 0){
						foreach($orderproducts as $orderproduct){
							$productaarray = array();
						$productDet = Product::findOne($orderproduct['product_id']);
---
SELECT * FROM `product` WHERE `ID`='981'